---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.MaterialThickness
source: html/8e98353f-a0db-1074-690c-94196f03419e.htm
---
# Autodesk.Revit.DB.FabricationPart.MaterialThickness Property

The material thickness of the fabrication part.

## Syntax (C#)
```csharp
public double MaterialThickness { get; }
```